<h1 align="center">SpaceX  Falcon 9 first stage Landing Prediction - EDA SQL</h1>

<div style="text-align:center">
    <img src='https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DS0701EN-SkillsNetwork/lab_v2/images/landing_1.gif'>
</div>

SpaceX has gained worldwide attention for a series of historic milestones. 

It is the only private company ever to return a spacecraft from low-earth orbit, which it first accomplished in December 2010.
SpaceX advertises Falcon 9 rocket launches on its website with a cost of 62 million dollars wheras other providers cost upward of 165 million dollars each, much of the savings is because Space X can reuse the first stage. 


Therefore if we can determine if the first stage will land, we can determine the cost of a launch. 

This information can be used if an alternate company wants to bid against SpaceX for a rocket launch.

This dataset includes a record for each payload carried during a SpaceX mission into outer space.

## Import Libraries and Define Auxiliary Functions

In [5]:
import pandas as pd
import sqlite3
import warnings

In [6]:
warnings.filterwarnings("ignore")

### Download the dataset

This assignment requires we to load the spacex dataset.

In many cases the dataset to be analyzed is available as a .CSV (comma separated values) file, perhaps on the internet. Click on the link below to download and save the dataset (.CSV file):

 <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv" target="_blank">Spacex DataSet</a>

### Connect to the database

Let us first load the SQL extension and establish a connection with the database

In [7]:
con = sqlite3.connect("my_data1.db")
cur = con.cursor()
print('con:', con)
print('cur:', cur)

con: <sqlite3.Connection object at 0x000001EFE11695D0>
cur: <sqlite3.Cursor object at 0x000001EF827AD0C0>

In [8]:
df = pd.read_csv("https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv")
df.to_sql("SPACEXTBL", con, if_exists='replace', index=False,method="multi")

101

In [9]:
%load_ext sql

In [10]:
%sql sqlite:///my_data1.db

### Remove blank rows from table

In [11]:
%sql create table SPACEXTABLE as select * from SPACEXTBL where Date is not null

 * sqlite:///my_data1.db
(sqlite3.OperationalError) table SPACEXTABLE already exists
[SQL: create table SPACEXTABLE as select * from SPACEXTBL where Date is not null]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [12]:
%%sql 
SELECT *
FROM SPACEXTBL 
LIMIT 5

 * sqlite:///my_data1.db
Done.

[('2010-06-04', '18:45:00', 'F9 v1.0  B0003', 'CCAFS LC-40', 'Dragon Spacecraft Qualification Unit', 0, 'LEO', 'SpaceX', 'Success', 'Failure (parachute)'),
 ('2010-12-08', '15:43:00', 'F9 v1.0  B0004', 'CCAFS LC-40', 'Dragon demo flight C1, two CubeSats, barrel of Brouere cheese', 0, 'LEO (ISS)', 'NASA (COTS) NRO', 'Success', 'Failure (parachute)'),
 ('2012-05-22', '7:44:00', 'F9 v1.0  B0005', 'CCAFS LC-40', 'Dragon demo flight C2', 525, 'LEO (ISS)', 'NASA (COTS)', 'Success', 'No attempt'),
 ('2012-10-08', '0:35:00', 'F9 v1.0  B0006', 'CCAFS LC-40', 'SpaceX CRS-1', 500, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt'),
 ('2013-03-01', '15:10:00', 'F9 v1.0  B0007', 'CCAFS LC-40', 'SpaceX CRS-2', 677, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt')]

### Names of the unique launch sites in the space mission

In [13]:
%%sql 
SELECT DISTINCT Launch_Site 
FROM SPACEXTBL

 * sqlite:///my_data1.db
Done.

[('CCAFS LC-40',), ('VAFB SLC-4E',), ('KSC LC-39A',), ('CCAFS SLC-40',)]

### 5 records where launch sites begin with the string 'KSC'

In [14]:
%%sql
SELECT * 
FROM SPACEXTBL WHERE Launch_Site 
LIKE 'KSC%' 
LIMIT 5

 * sqlite:///my_data1.db
Done.

[('2017-02-19', '14:39:00', 'F9 FT B1031.1', 'KSC LC-39A', 'SpaceX CRS-10', 2490, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'Success (ground pad)'),
 ('2017-03-16', '6:00:00', 'F9 FT B1030', 'KSC LC-39A', 'EchoStar 23', 5600, 'GTO', 'EchoStar', 'Success', 'No attempt'),
 ('2017-03-30', '22:27:00', 'F9 FT  B1021.2', 'KSC LC-39A', 'SES-10', 5300, 'GTO', 'SES', 'Success', 'Success (drone ship)'),
 ('2017-05-01', '11:15:00', 'F9 FT B1032.1', 'KSC LC-39A', 'NROL-76', 5300, 'LEO', 'NRO', 'Success', 'Success (ground pad)'),
 ('2017-05-15', '23:21:00', 'F9 FT B1034', 'KSC LC-39A', 'Inmarsat-5 F4', 6070, 'GTO', 'Inmarsat', 'Success', 'No attempt')]

### Total payload mass carried by boosters launched by NASA (CRS)

In [15]:
%%sql 
SELECT SUM(PAYLOAD_MASS__KG_) 
FROM SPACEXTBL 
WHERE Customer = 'NASA (CRS)'

 * sqlite:///my_data1.db
Done.

[(45596,)]

### Average payload mass carried by booster version F9 v1.1

In [16]:
%%sql 
SELECT AVG(PAYLOAD_MASS__KG_) 
FROM SPACEXTBL 
WHERE Booster_Version = 'F9 v1.1'

 * sqlite:///my_data1.db
Done.

[(2928.4,)]

### Date where the successful landing outcome in drone ship was achieved.

In [17]:
%%sql 
SELECT DISTINCT Date
FROM SPACEXTBL
WHERE Landing_Outcome = 'Success (drone ship)'

 * sqlite:///my_data1.db
Done.

[('2016-04-08',),
 ('2016-05-06',),
 ('2016-05-27',),
 ('2016-08-14',),
 ('2017-01-14',),
 ('2017-03-30',),
 ('2017-06-23',),
 ('2017-06-25',),
 ('2017-08-24',),
 ('2017-10-09',),
 ('2017-10-11',),
 ('2017-10-30',),
 ('2018-04-18',),
 ('2018-05-11',)]

In [18]:
%%sql
SELECT MIN(Date) 
FROM SPACEXTBL 
WHERE Landing_Outcome = 'Success (drone ship)'

 * sqlite:///my_data1.db
Done.

[('2016-04-08',)]

### Names of the boosters which have success in ground pad  and have payload mass greater than 4000 but less than 6000

In [19]:
%%sql 
SELECT Booster_Version 
FROM SPACEXTBL WHERE Landing_Outcome = 'Success (ground pad)' AND PAYLOAD_MASS__KG_> 4000 AND PAYLOAD_MASS__KG_< 6000

 * sqlite:///my_data1.db
Done.

[('F9 FT B1032.1',), ('F9 B4 B1040.1',), ('F9 B4 B1043.1',)]

### Total number of successful and failure mission outcomes

In [20]:
%%sql 
SELECT DISTINCT Mission_Outcome 
FROM SPACEXTBL

 * sqlite:///my_data1.db
Done.

[('Success',),
 ('Failure (in flight)',),
 ('Success (payload status unclear)',),
 ('Success ',)]

In [21]:
%%sql 
SELECT COUNT(Mission_Outcome) 
FROM SPACEXTBL 
WHERE Mission_Outcome = 'Failure (in flight)'

 * sqlite:///my_data1.db
Done.

[(1,)]

In [22]:
%%sql 
SELECT COUNT(Mission_Outcome) 
FROM SPACEXTBL WHERE Mission_Outcome = 'Success' OR Mission_Outcome = 'Success (payload status unclear)'

 * sqlite:///my_data1.db
Done.

[(99,)]

### Names of the booster_versions which have carried the maximum payload mass

In [23]:
%%sql 
SELECT Booster_Version 
FROM SPACEXTBL WHERE PAYLOAD_MASS__KG_= (SELECT MAX(PAYLOAD_MASS__KG_) 
                                         FROM SPACEXTBL
                                        )

 * sqlite:///my_data1.db
Done.

[('F9 B5 B1048.4',),
 ('F9 B5 B1049.4',),
 ('F9 B5 B1051.3',),
 ('F9 B5 B1056.4',),
 ('F9 B5 B1048.5',),
 ('F9 B5 B1051.4',),
 ('F9 B5 B1049.5',),
 ('F9 B5 B1060.2 ',),
 ('F9 B5 B1058.3 ',),
 ('F9 B5 B1051.6',),
 ('F9 B5 B1060.3',),
 ('F9 B5 B1049.7 ',)]

### Records which will display the month names, successful landing_outcomes in ground pad ,booster versions, launch_site for the months in year 2017

In [34]:
%%sql 
SELECT substr(Date,6,2) AS Month, substr(Date,0,5) AS Year_, Landing_Outcome, Booster_Version, Launch_Site 
FROM SPACEXTBL WHERE Year_= '2017' AND Landing_Outcome='Success (ground pad)'

 * sqlite:///my_data1.db
Done.

[('02', '2017', 'Success (ground pad)', 'F9 FT B1031.1', 'KSC LC-39A'),
 ('05', '2017', 'Success (ground pad)', 'F9 FT B1032.1', 'KSC LC-39A'),
 ('06', '2017', 'Success (ground pad)', 'F9 FT B1035.1', 'KSC LC-39A'),
 ('08', '2017', 'Success (ground pad)', 'F9 B4 B1039.1', 'KSC LC-39A'),
 ('09', '2017', 'Success (ground pad)', 'F9 B4 B1040.1', 'KSC LC-39A'),
 ('12', '2017', 'Success (ground pad)', 'F9 FT  B1035.2', 'CCAFS SLC-40')]

### Rank of count of landing outcomes such as Failure (drone ship) or Success (ground pad)) between the date 2010-06-04 and 2017-03-20, in descending order

In [25]:
%%sql 
SELECT Landing_Outcome, count(Landing_Outcome) AS Count_Landing_Outcome 
FROM SPACEXTBL WHERE Date > '2010-06-04' AND Date < '2017-03-20' 
GROUP BY Landing_Outcome 
ORDER BY Count_Landing_Outcome DESC

 * sqlite:///my_data1.db
Done.

[('No attempt', 10),
 ('Success (drone ship)', 5),
 ('Failure (drone ship)', 5),
 ('Success (ground pad)', 3),
 ('Controlled (ocean)', 3),
 ('Uncontrolled (ocean)', 2),
 ('Precluded (drone ship)', 1),
 ('Failure (parachute)', 1)]